<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="0" name="Parameter_1" type="Parameter" version="opset1">
			<data shape="1,3,32" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="Parameter_1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_2" type="Const" version="opset1">
			<data element_type="f32" shape="1, 2, 64" offset="0" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_3" type="Const" version="opset1">
			<data element_type="f32" shape="1, 2, 64" offset="0" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="512" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_5" type="Const" version="opset1">
			<data element_type="i8" shape="2, 256, 32" offset="520" size="16384" />
			<output>
				<port id="0" precision="I8">
					<dim>2</dim>
					<dim>256</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Convert_6" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>2</dim>
					<dim>256</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_7" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="16904" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Multiply_8" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_9" type="Const" version="opset1">
			<data element_type="i8" shape="2, 256, 64" offset="17928" size="32768" />
			<output>
				<port id="0" precision="I8">
					<dim>2</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Convert_10" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>2</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_11" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="16904" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Multiply_12" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_13" type="Const" version="opset1">
			<data element_type="f32" shape="2, 256" offset="50696" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="LSTM_to_2_ti" type="LSTMSequence" version="opset5">
			<data direction="bidirectional" hidden_size="64" activations="sigmoid, tanh, tanh" activations_alpha="" activations_beta="" clip="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>32</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
				<port id="6" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
				<port id="8" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
				<port id="9" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Result_15" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>64</dim>
				</port>
			</input>
		</layer>
		<layer id="15" name="Result_16" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
			</input>
		</layer>
		<layer id="14" name="Result_17" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="13" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="13" to-port="1" />
		<edge from-layer="2" from-port="0" to-layer="13" to-port="2" />
		<edge from-layer="3" from-port="0" to-layer="13" to-port="3" />
		<edge from-layer="4" from-port="0" to-layer="5" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="7" to-port="0" />
		<edge from-layer="6" from-port="0" to-layer="7" to-port="1" />
		<edge from-layer="7" from-port="2" to-layer="13" to-port="4" />
		<edge from-layer="8" from-port="0" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="11" to-port="0" />
		<edge from-layer="10" from-port="0" to-layer="11" to-port="1" />
		<edge from-layer="11" from-port="2" to-layer="13" to-port="5" />
		<edge from-layer="12" from-port="0" to-layer="13" to-port="6" />
		<edge from-layer="13" from-port="9" to-layer="14" to-port="0" />
		<edge from-layer="13" from-port="8" to-layer="15" to-port="0" />
		<edge from-layer="13" from-port="7" to-layer="16" to-port="0" />
	</edges>
	<rt_info />
</net>
